# ООП                                                                                                                                                           

class MyClass:                          # Оголошення класу                                                                                                                                           
    x = 10                              # поле у класі - public static                                                                                                                                       
                                        #                                                                                                                               
                                        #                                                                                                                               
def demo1() -> None:                    #                                                                                                                                               
    obj1 = MyClass()                    # Особливість - оператор new не вживається                                                                                                                                               
    obj2 = MyClass()                    #                                                                                                                                                    
    print(obj1.x, obj2.x, MyClass.x)    # 10 10 10
    MyClass.x=20                        # Зміна поля класу - змінює в усіх об'єктах
    print(obj1.x, obj2.x, MyClass.x)    # 20 20 20
    obj1.x=15                           # !! це не зміна, а створення об'єктного (локального) поля
    print(obj1.x, obj2.x, MyClass.x)    # 15 20 20
    MyClass.x=30                        #
    print(obj1.x, obj2.x, MyClass.x)    # 15 30 30      15-локальне поле onj1, в інших - поле класу
    obj2.y = 5                          # склад об'єктів може змінюватись під час виконання
    obj2.w = 5                          # програми - як додаватись, так і вилучатись
    del obj1.x                          # так і вилучатись (тут видалене об'єктне поле)
    print(obj1.x, obj2.x, MyClass.x)    # 30 30 30 і тепер obj1.x посилається на класове
                                        #
    pass                                #                                                                                                                                       
                                        #
                                        #
class TheClass:                         # Для того щоб створити поля об'єктів, необхідний                                                                                                                                                                            
    x = 10                              # їх екземпляр (instance). Він з'являється у                                                                                                                                                                        
                                        # конструкторі. Конструктор має спеціальне ім'я __init__
    def __init__(self,                  # Покажчик "this" у Python не є неявним, всі методи
               a=1,b=2 ) -> None:       # першим параметром мають його оголосити. При зверненні 
        self.a=a                        # до полів префікс "self" є обов'язковим.                                                                                                                                               
        self.b=b                        # Перегрузки методів немає, повторна декларація відміняє
        pass                            # попередню (як пере-присвоєння). Для варіативності  
                                        # застосовують параметри із значенням за замовчанням
    def __str__(self) -> str:           # Аналог ToString() - дозволяє виводити об'єкт або
        return f"({self.a}, {self.b})"  # включати його до рядкових операцій чи перетворювати до str            

    def magnitude(self)->int:           # Власні методи оголошуються за формалзімом функцій
        return self.a + self.b          # з обов'язковим першим параметром self
    
                                        #  
def demo2() -> None:                    # При створенні об'єктів в конструктор self передавати    
    obj1 = TheClass()                   # не треба, без параметрів - за дефолтом
    print(obj1.a, obj1.b);              #
    print(TheClass(30,20))              # 
    print(TheClass(b=40))
    print(obj1.magnitude())             # При виклику методів self не зазначається
                                        # 
                                        #                                                                                                                                                              
def main() -> None:                     #                                                                                                                                                                                
    demo2()                             #                                                                                                                                                                                    
                                        #                                                                                                                               
                                        #                                                                                                                               
if __name__ == "__main__":              #                                                                                                                                                       
    main()                                                                                                                                                          
