# Функції
def pair():     # def - ключове слово для оглошення функції
    return 1, 2  # повернення значення (кортеж)
                # Рекомендація - залишати щонайменше
                # два порожні рядки
def hello() -> str:         # Опціональне зазначення типу повернення ф-ції
    return "Hello, World"   #


def printPair(x, y):
    # str = "x = %d, y =%d" % (x, y)
    str = "x = %d, y =%d" % pair()
    print(str)


def main() -> None:
    print(hello())
    x,y = pair()
    printPair(x, y)

# Одне з використань функцій - створення "точки входження"
# це корисне для впровадження інжектування, а також для
# розрізнення підключення файлу, як модуля, та його запуску, як
# головної програми
if __name__ == '__main__' : main() 